// מאגר השאלות והתשובות שחולצו מהקובץ
const questions = [
      {
    "question": "אלו מהפרמטרים הבאים יכולים לשנות Km של אנזים (לא-אלוסטרי)?",
    "options": [
      "טמפרטורה.",
      "ריכוז האנזים.",
      "ריכוז הסובסטרט.",
      "כל התשובות נכונות."
    ],
    "answer": "טמפרטורה."
  },
  {
    "question": "אלו מהתוצרים הבאים משותפים למעגל האוראה ומעגל חומצת הלימון?",
    "options": [
      "כל התשובות נכונות.",
      "a-ketoglutarate.",
      "Fumarate.",
      "Oxaloacetate."
    ],
    "answer": "כל התשובות נכונות."
  },
  {
    "question": "במעבדה שורטטה עקומת מיכאליס-מנטן עבור אנזים מסוים. לאחר הוספת חומר X שורטטה עקומה חדשה אשר ממנה עולה כי Km ירד ו Vmax לא השתנה. חומר X הינו לפיכך:",
    "options": [
      "מעכב תחרותי (Competitive)",
      "מעכב לא תחרותי (Non-competitive)",
      "מעכב לא תחרותי Uncompetitive",
      "אפקטור אלוסטרי חיובי"
    ],
    "answer": "אפקטור אלוסטרי חיובי"
  },
  {
    "question": "אצל חולה הסובל מסוכרת סוג 1 (אינו מייצר אינסולין) אלו מהתהליכים הבאים נצפה לראות בכבד?",
    "options": [
      "גלוקוניאוגניזה.",
      "סינתזת גליקוגן.",
      "סינתזת חומצות שומן.",
      "כל התשובות נכונות."
    ],
    "answer": "גלוקוניאוגניזה."
  },
  {
    "question": "באלו מהמצבים הבאים נראה הפעלה גבוהה של מעגל האוראה בכבד?",
    "options": [
      "מצב של רעב מתמשך.",
      "דיאטה עשירה בפחמימות וסוכרים.",
      "דיאטה עשירה בשומנים.",
      "צום של 12 שעות."
    ],
    "answer": "מצב של רעב מתמשך."
  },
  {
    "question": "באלו רקמות ימצא האנזים Alanine transaminase ?",
    "options": [
      "בכבד ובשרירים.",
      "בכבד.",
      "בשריר.",
      "באף אחד מהם."
    ],
    "answer": "בכבד ובשרירים."
  },
  {
    "question": "במה נבדלים הדי-סכריד מלטוז והדיסכריד סוכרוז זה מזה?",
    "options": [
      "כל התשובות נכונות.",
      "למלטוז יש קצה מחזר ולסוכרוז לא.",
      "הסוכרוז בנוי משני מונוסכרידים שונים.",
      "את המלטוז ניתן להאריך ואת הסוכרוז לא."
    ],
    "answer": "כל התשובות נכונות."
  },
  {
    "question": "המולקולות alphaD-glucose ו betaD-glucose מתייחסות זו לזו כ:",
    "options": [
      "אנומרים",
      "אפימרים",
      "דיאסטראומרים",
      "אננטיומרים"
    ],
    "answer": "אנומרים"
  },
  {
    "question": "מי מהמבנים הבאים אינו נבנה באמצעות גליצרול?",
    "options": [
      "טריגליצריד",
      "גליצרופוספוליפיד",
      "ספינגוליפיד",
      "אין תשובה נכונה (כולם נבנים באמצעות גליצרול)"
    ],
    "answer": "ספינגוליפיד"
  },
  {
    "question": "האנזים cytochrome C ברוב הזמן הנו:",
    "options": [
      "חלבון ממברנה פריפריאלי.",
      "חלבון ממברנה אינטגראלי.",
      "חלבון ציטוזולי.",
      "חלבון מטריקס מיטוכונדריאלי."
    ],
    "answer": "חלבון ממברנה פריפריאלי."
  },
  {
    "question": "האנזים שהכי דומה במבנהו ל pyruvate dehydrogenase הנו:",
    "options": [
      "alpha -ketoglutarate dehydrogenasea.",
      "Aconitase.",
      "Succinate dehydrogenase.",
      "אף תשובה אינה נכונה."
    ],
    "answer": "alpha -ketoglutarate dehydrogenasea."
  },
  {
    "question": "היכן מתרחש מעגל האוראה בתאי הכיליה?",
    "options": [
      "באף אחד מהם.",
      "במטריקס של המיטוכונדריה.",
      "בציטוזול.",
      "בשניהם."
    ],
    "answer": "באף אחד מהם."
  },
  {
    "question": "הפעלה של אלו מסלולים בתאי כבד תביא לפעילות יתר של האנזים Glucose-6-phosphatase:",
    "options": [
      "שניהם.",
      "גלוקוניאוגניזה.",
      "פירוק של גליקוגן.",
      "אף תשובה אינה נכונה."
    ],
    "answer": "שניהם."
  },
  {
    "question": "התוצר של האנזים Fructokinase הנו?",
    "options": [
      "Fructose -1- phosphate.",
      "Fructose -6- phosphate.",
      "Glucose -1- phosphate.",
      "Glucose -6- phosphate."
    ],
    "answer": "Fructose -1- phosphate."
  },
  {
    "question": "התוצר של האנזים hexokinase הנו?",
    "options": [
      "Fructose -6- phosphate.",
      "Fructose -1- phosphate.",
      "Glucose -1- phosphate.",
      "Glucose -1,6- bisphosphate."
    ],
    "answer": "Fructose -6- phosphate."
  },
  {
    "question": "חומצות אמינו גלוקוגניות הנם חומצות אמינו שבמסלולים מטבולים ניתן לקבל מהם:",
    "options": [
      "Oxaloacetate.",
      "Acetyl-CoA.",
      "Malonyl-CoA.",
      "Acetoacetyl-CoA."
    ],
    "answer": "Oxaloacetate."
  },
  {
    "question": "חיזור +NADP ל NADPH מתרחש ב:",
    "options": [
      "פאזה מחמצנת של מסלול הפנטוזות.",
      "פאזה לא מחמצנת של מסלול הפנטוזות.",
      "סינתזה של חומצות שומן.",
      "גלוקוניאוגנזה.",
      "כל התשובות נכונות."
    ],
    "answer": "פאזה מחמצנת של מסלול הפנטוזות."
  },
  {
    "question": "חימצון NADH ל NAD+ מתרחש ב:",
    "options": [
      "גלוקוניאוגניזה.",
      "פאזה לא מחמצנת של מסלול הפנטוזות.",
      "סינתזה של חומצות שומן.",
      "פאזה מחמצנת של מסלול הפנטוזות.",
      "כל התשובות נכונות."
    ],
    "answer": "גלוקוניאוגניזה."
  },
  {
    "question": "באלו מהתהליכים הבאים מתרחש חימצון של NADPH ל +NADP?",
    "options": [
      "סינטזה של חומצות שומן",
      "פרמנטציה של פירובאט ללקטאט",
      "מסלול הפנטוזות",
      "גליקוליזה"
    ],
    "answer": "סינטזה של חומצות שומן"
  },
  {
    "question": "כאשר אלדוז בעל 6 פחמנים נסגר למבנה טבעת furanose , הטבעת נסגרת בין הפחמנים:",
    "options": [
      "1, 5.",
      "2, 5.",
      "1, 6.",
      "2, 6."
    ],
    "answer": "1, 5."
  },
  {
    "question": "כאשר חסר ברזל בתא מה קורה לאנזים אקוניטאז (aconitase)?",
    "options": [
      "כל התשובות נכונות.",
      "פעילותו במעגל חומצת הלימון נפגעת.",
      "הופך ל Apo-aconitase.",
      "הופך ל IRP1."
    ],
    "answer": "כל התשובות נכונות."
  },
  {
    "question": "כאשר קטוז בעל 6 פחמנים נסגר למבנה טבעת furanose , הטבעת נסגרת בין הפחמנים:",
    "options": [
      "2, 6.",
      "2, 5.",
      "1, 6.",
      "1, 5."
    ],
    "answer": "2, 5."
  },
  {
    "question": "כיצד ישפיע אפקטור אלוסטרי חיובי המעלה את הזיקה של האנזים לסובסטרט על עקומת מיכאליס מנטן של האנזים?",
    "options": [
      "יקטין את ה Km.",
      "יגדיל את ה Km.",
      "יקטין את Vmax.",
      "יגדיל את Vmax."
    ],
    "answer": "יקטין את ה Km."
  },
  {
    "question": "כיצד משפיעה נוכחות גבוהה של ATP על הפעילות האנזימטית של Phosphofructokinase-1?",
    "options": [
      "מעלה את הKm.",
      "מורידה את הKm.",
      "מעלה Vmax.",
      "מורידה Vmax.",
      "לא משפיעה כלל על הפעילות האנזימטית."
    ],
    "answer": "מעלה את הKm."
  },
  {
    "question": "כמה ATP ניתן להפיק מ acetoacetate בתנאים של חוסר חמצן?",
    "options": [
      "0.",
      "2.",
      "10.",
      "20."
    ],
    "answer": "0."
  },
  {
    "question": "כמה מולקולות ATP או GTP נוצרות מגלוקוז אחד, במעגל חומצת הלימון בלבד, באופן ישיר (ללא נשאי אלקטרונים)?",
    "options": [
      "2.",
      "1.",
      "0.",
      "10.",
      "20."
    ],
    "answer": "2."
  },
  {
    "question": "כמה מולקולות ATP ניתן לקבל ממולקולת לקטט אחת בכבד? (הניחו ניצול מלא של נשאי האלקטרונים)",
    "options": [
      "15.",
      "12.5.",
      "10.",
      "2."
    ],
    "answer": "15."
  },
  {
    "question": "למבחנה המכילה תמיסה עם אנזים הוכנס סובסטרט בריכוז השווה לערך הKm של האנזים. מהי המהירות ההתחלתית V0 שנמדדה?",
    "options": [
      "חצי מהמהירות המקסימלית (Vmax).",
      "אפס. לא תימדד כל מהירות.",
      "זהה למהירות המקסימאלית.",
      "מהירות כפולה מהמהירות המקסימאלית."
    ],
    "answer": "חצי מהמהירות המקסימלית (Vmax)."
  },
  {
    "question": "למי מהאנזימים הבאים הזיקה לסובסטרט היא הגבוהה ביותר?",
    "options": [
      "אנזים בעל Km=10^-7",
      "אנזים בעל Km=10^-6",
      "אנזים בעל Km=10^-5",
      "אנזים בעל Km=10^-4"
    ],
    "answer": "אנזים בעל Km=10^-7"
  },
  {
    "question": "מה אינו נכון לגבי בקרה על גליקוליזה?",
    "options": [
      "אינסולין מעודד גליקוליזה",
      "אף תשובה אינה נכונה",
      "חוסר אנרגתי בתא יעודד גליקוליזה",
      "הבקרה על פירוק גלוקוז ופרוקטוז הינה דומה",
      "F26BP  מעודד גליקוליזה ומעכב גלוקונאוגנזה"
    ],
    "answer": "הבקרה על פירוק גלוקוז ופרוקטוז הינה דומה"
  },
  {
    "question": "מי מהמסלולים הבאים יכולים להתקיים יחד בתאי כבד?",
    "options": [
      "גליקוליזה וגלוקונאוגנזה",
      "פירוק חומצות אמינו וסינתזה של חומצות שומן",
      "חמצון בטא וסינתזה של חומצות שומן",
      "פירוק חומצות אמינו וגלוקונאוגנזה"
    ],
    "answer": "פירוק חומצות אמינו וגלוקונאוגנזה"
  },
  {
    "question": "מי מהמסלולים הבאים יופעל ביתר בתאי כבד כתוצאה מעליה בהורמון הגלוקגון?",
    "options": [
      "גליקוליזה",
      "סינתזה של חומצות שומן",
      "סינתזה של גליקוגן",
      "חמצון בטא"
    ],
    "answer": "חמצון בטא"
  },
  {
    "question": "מי מהתוצרים הבאים ייוצר אך ורק בתאי כבד?",
    "options": [
      "Fructose-1-Phosphate",
      "כל התשובות נכונות",
      "Fructose-2,6, bisphosphate",
      "Hydroxybutirate"
    ],
    "answer": "כל התשובות נכונות"
  },
  {
    "question": "מהו הסובסטרט של האנזים UDP-glucose phosphorylase?",
    "options": [
      "Glucose-1-phosphate.",
      "Glucose-6-phosphate.",
      "UDP-glucose.",
      "Glycogen.",
      "Glucose."
    ],
    "answer": "Glucose-1-phosphate."
  },
  {
    "question": "מהו חומר המוצא המשותף לתהליכי סינתזת חומצות שומן וכולסטרול?",
    "options": [
      "Acetyl-CoA.",
      "Malonyl-CoA.",
      "Mavelonate.",
      "Isoprene.",
      "כל התשובות נכונות."
    ],
    "answer": "Acetyl-CoA."
  },
  {
    "question": "מי מהאנזימים הבאים כלל אינו מזרז תגובת חימצון לסובסטרט שלו?",
    "options": [
      "ATP synthase.",
      "NADH dehydrogenase.",
      "Cytochrome C oxidase.",
      "Succinate dehydrogenase."
    ],
    "answer": "ATP synthase."
  },
  {
    "question": "מי מהאנזימים הבאים כלל אינו מעביר פרוטונים (יוני מימן) דרכו?",
    "options": [
      "Succinate dehydrogenase.",
      "NADH dehydrogenase.",
      "Cytochrome C oxidase.",
      "ATP synthase."
    ],
    "answer": "Succinate dehydrogenase."
  },
  {
    "question": "מי מהחומרים הבאים אינו סובסטרט של האנזים הקסוקינאז?",
    "options": [
      "Galactose.",
      "Glucose.",
      "Fructose.",
      "Mannose."
    ],
    "answer": "Galactose."
  },
  {
    "question": "מי מהמסלולים הבאים יופעל ביתר בתאי כבד כתוצאה מעליה בהורמון האינסולין?",
    "options": [
      "כל התשובות נכונות.",
      "סינתזה של חומצות שומן.",
      "סינתזה של גליקוגן.",
      "גליקוליזה."
    ],
    "answer": "כל התשובות נכונות."
  },
  {
    "question": "מי מהמסלולים הבאים יופעל ביתר בתאי כבד כתוצאה מעליה בהורמון הגלוקגון?",
    "options": [
      "חמצון בטא.",
      "סינתזה של חומצות שומן.",
      "סינתזה של גליקוגן.",
      "גליקוליזה."
    ],
    "answer": "חמצון בטא."
  },
  {
    "question": "מי מהמסלולים הבאים יכולים להתקיים ביחד בתאי כבד?",
    "options": [
      "פירוק חומצות אמינו וגלוקוניאוגניזה.",
      "פירוק חומצות אמינו וסינטזה של חומצות שומן.",
      "גליקוליזה וגלוקוניאוגניזה.",
      "חמצון בטא וסינטזה של חומצות שומן."
    ],
    "answer": "פירוק חומצות אמינו וגלוקוניאוגניזה."
  },
  {
    "question": "מי מהמסלולים הבאים לא מתקיים בפועל?",
    "options": [
      "פירוק חומצות אמינו לצורך בניית חומצות שומן.",
      "פירוק חומצות אמינו לצורך בניית גופי קטון.",
      "פירוק חומצות אמינו לצורך בניית גלוקוז.",
      "פירוק חומצות אמינו לצורך בניית גליקוגן."
    ],
    "answer": "פירוק חומצות אמינו לצורך בניית חומצות שומן."
  },
  {
    "question": "במעבדה שורטטה עקומת מיכאליס-מנטן עבור אנזים מסוים. לאחר הוספת חומר X שורטטה עקומה חדשה אשר ממנה עולה כי ה Km עלה ו Vmax ירד. חומר X הינו לפיכך:",
    "options": [
      "מעכב תחרותי (Competitive)",
      "מעכב לא תחרותי מסוג mixed inhibitor",
      "מעכב לא תחרותי מסוג uncompetitive",
      "אפקטור אלוסטרי חיובי"
    ],
    "answer": "מעכב לא תחרותי מסוג mixed inhibitor"
  },
  {
    "question": "פוספוריליזה (פירוק קשר באמצעות זרחון) של גליקוגן מתרחשת ב:",
    "options": [
      "פירוק גליקוגן בתאים.",
      "בניית גליקוגן בתאים.",
      "פירוק של גליקוגן במערכת העיכול.",
      "כל התשובות נכונות."
    ],
    "answer": "פירוק גליקוגן בתאים."
  },
  {
    "question": "פעילותו של מי מהאנזימים הבאים בגליקוליזה תקטן משמעותית, כאשר יהיה עודף ATP בתא?",
    "options": [
      "phsphofructokinase1.",
      "Hexokinase.",
      "Aldolase.",
      "Enolase."
    ],
    "answer": "phsphofructokinase1."
  },
  {
    "question": "קצה מחזר יכול להיות?",
    "options": [
      "רק הפחמן האנומרי בטבעת המונוסכרידית.",
      "כל פחמן ופחמן על גבי הטבעת המונוסכרידית.",
      "רק פחמנים מחוץ לטבעת המונוסכרידית.",
      "אין כל חשיבות למיקום הפחמן בטבעת המונוסכרידית."
    ],
    "answer": "רק הפחמן האנומרי בטבעת המונוסכרידית."
  },
  {
    "question": "קשר גליקוזידי יכול להיווצר?",
    "options": [
      "בין לפחות קצה מחזר אחד מבין הטבעות המונוסכרידיות.",
      "בין כל פחמן לכל פחמן על גבי הטבעות המונוסכרידיות.",
      "רק בין שני קצוות מחזרים על גבי הטבעות המונוסכרידיות.",
      "רק בין שני קצוות לא מחזרים על גבי טבעות מונוסכרידיות."
    ],
    "answer": "בין לפחות קצה מחזר אחד מבין הטבעות המונוסכרידיות."
  },
  {
    "question": "מה הרווח האנרגטי בחמצון מלא של מול חומצה פרופיונית CH3-CH2-COOH?",
    "options": [
      "5 מול ATP",
      "10 מול ATP",
      "2 מול ATP",
      "4 מול ATP"
    ],
    "answer": "2 מול ATP"
  }
];
